In [16]:
# Cwiczenie 2
import pandas as pd
#Zadanie 1
titanic = pd.read_csv('titanic.csv')

#Zadanie 2
titanic.head(20)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48,0,0,19952,26.55,E12,S,3,?,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63,1,0,13502,77.9583,D7,S,10,?,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39,0,0,112050,0,A36,S,?,?,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53,2,0,11769,51.4792,C101,S,D,?,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71,0,0,PC 17609,49.5042,?,C,?,22,"Montevideo, Uruguay"
10,1,0,"Astor, Col. John Jacob",male,47,1,0,PC 17757,227.525,C62 C64,C,?,124,"New York, NY"
11,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18,1,0,PC 17757,227.525,C62 C64,C,4,?,"New York, NY"
12,1,1,"Aubart, Mme. Leontine Pauline",female,24,0,0,PC 17477,69.3,B35,C,9,?,"Paris, France"
13,1,1,"Barber, Miss. Ellen 'Nellie'",female,26,0,0,19877,78.85,?,S,6,?,?
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80,0,0,27042,30,A23,S,B,?,"Hessle, Yorks"
15,1,0,"Baumann, Mr. John D",male,?,0,0,PC 17318,25.925,?,S,?,?,"New York, NY"
16,1,0,"Baxter, Mr. Quigg Edmond",male,24,0,1,PC 17558,247.5208,B58 B60,C,?,?,"Montreal, PQ"
17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50,0,1,PC 17558,247.5208,B58 B60,C,6,?,"Montreal, PQ"
18,1,1,"Bazzani, Miss. Albina",female,32,0,0,11813,76.2917,D15,C,8,?,?
19,1,0,"Beattie, Mr. Thomson",male,36,0,0,13050,75.2417,C6,C,A,?,"Winnipeg, MN"

Widzę informacje takie jak imie uczestnika, jego płeć, wiek, itd. oraz brakujące wartości oznaczone przez '?'.

In [17]:
#Zadanie 3
import numpy as np
titanic=titanic.replace('?',np.NaN)
titanic.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [18]:
titanic.isnull().mean()

pclass       0.000000
survived     0.000000
name         0.000000
sex          0.000000
age          0.200917
sibsp        0.000000
parch        0.000000
ticket       0.000000
fare         0.000764
cabin        0.774637
embarked     0.001528
boat         0.628724
body         0.907563
home.dest    0.430863
dtype: float64

W 'age' brakuje 20% danych, w 'home.dest' 43%, w 'cabin', 'embarked' oraz 'boat' brakuje ponad 50% (kolejno 77, 62 oraz 90%), w 'embarked' oraz 'fare' brakujących wartości jest mniej niż 1%.<br>
<br>
Zadanie 4 <br>
Według mnie braki danych są nie przypadkowe (MNAR), mogą być one spowodowane ilości pasażerów, którzy nie przeżyli tego rejsu. W przypadku 'fare' i 'embarked' są one całkowicie przypadkowe (NaN <=5%).

In [19]:
titanic['AgeNull'] = np.where(titanic['age'].isnull(), 1, 0)
titanic['CabinNull'] = np.where(titanic['cabin'].isnull(), 1, 0)
titanic['BoatNull'] = np.where(titanic['boat'].isnull(), 1, 0)
titanic['BodyNull'] = np.where(titanic['body'].isnull(), 1, 0)
titanic['HomeDestNull'] = np.where(titanic['home.dest'].isnull(), 1, 0)

titanic.groupby(['survived'])['AgeNull'].mean()

survived
0    0.234858
1    0.146000
Name: AgeNull, dtype: float64

In [20]:
titanic.groupby(['survived'])['CabinNull'].mean()

survived
0    0.873918
1    0.614000
Name: CabinNull, dtype: float64

In [21]:
titanic.groupby(['survived'])['BoatNull'].mean()

survived
0    0.988875
1    0.046000
Name: BoatNull, dtype: float64

In [22]:
titanic.groupby(['survived'])['BodyNull'].mean()

survived
0    0.850433
1    1.000000
Name: BodyNull, dtype: float64

In [26]:
titanic.groupby(['survived'])['HomeDestNull'].mean()

survived
0    0.508035
1    0.306000
Name: HomeDestNull, dtype: float64

W każdej kolumnie z brakami danych procent brakujących danych jest większy w przypadku wartości 0 w kolumnie survived.

In [27]:
#Spróbuj zapisać powyższe dwie linijki kodu za pomocą tylko jednej.
titanic['age'].isna().astype('int').groupby(titanic['survived']).mean()

survived
0    0.234858
1    0.146000
Name: age, dtype: float64

Zadanie 5<br>
Kolumny z małą ilością brakujących danych powinno się usunąć, a te ze znaczącą ilością powinno się pozostawić.

In [28]:
#Cwiczenie 3

#Zadanie 1
print('Liczba etykiet zmiennej name: {}'.format(len(titanic.name.unique()))) 
print('Liczba etykiet zmiennej sex: {}'.format(len(titanic.sex.unique()))) 
print('Liczba etykiet zmiennej cabin: {}'.format(len(titanic.cabin.unique()))) 
print('Liczba etykiet zmiennej embarked: {}'.format(len(titanic.embarked.unique()))) 
print('Liczba etykiet zmiennej boat: {}'.format(len(titanic.boat.unique()))) 
print('Liczba etykiet zmiennej home.dest: {}'.format(len(titanic['home.dest'].unique())))

Liczba etykiet zmiennej name: 1307
Liczba etykiet zmiennej sex: 2
Liczba etykiet zmiennej cabin: 187
Liczba etykiet zmiennej embarked: 4
Liczba etykiet zmiennej boat: 28
Liczba etykiet zmiennej home.dest: 370

In [29]:
#Zadania 2 i 3
print('Liczba pasażerów: {}'.format(len(titanic.name.unique())))

Liczba pasażerów: 1307

Zadanie 4 <br>
Duża kardynalość: name, cabin, home.dest<br>
Mała moc zbioru: sex, embarked, boat

In [30]:
#Zadanie 5
np.unique(titanic['cabin'].dropna()).size

186

Numpy array przechowuje dane jednego typa, a pandas DataFrame może przechowywać różnego typu. Dataframe może mieć etykiety przy kolumnach.

In [31]:
#Zadanie 6
titanic['CabinReduced'] = titanic['cabin'].astype(str).str[0]
titanic[['cabin','CabinReduced']].head(20)

      cabin CabinReduced
0        B5            B
1   C22 C26            C
2   C22 C26            C
3   C22 C26            C
4   C22 C26            C
5       E12            E
6        D7            D
7       A36            A
8      C101            C
9       NaN            n
10  C62 C64            C
11  C62 C64            C
12      B35            B
13      NaN            n
14      A23            A
15      NaN            n
16  B58 B60            B
17  B58 B60            B
18      D15            D
19       C6            C

In [32]:
#Zadanie 7
print('Liczba etykiet zmiennej CabinReduced: {}'.format(len(titanic.CabinReduced.unique()))) #9

Liczba etykiet zmiennej CabinReduced: 9

Zmniejszono kardynalność o około 95%.<br>
<br>
Zadanie 8<br>
Zmienna ta ma dużą moc zbioru, przez co może ona prowadzić do nieoptymalnego podziału na zbiory testowy i treningowy. Ułatwi to późniejszą pracę z danymi.